#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.oci_identity_availability_domains.ads: Reading...
data.oci_identity_availability_domain.ad: Reading...
data.oci_core_images.ubuntu: Reading...
oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.uk-london-1.amaaaaaagi4f4iial43yknsafwknobokxjq3fojlt3imhkbwhymqb6mwsg3q]
data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-4130005358]
data.oci_identity_availability_domain.ad: Read complete after 1s [id=ocid1.availabilitydomain.oc1..aaaaaaaapjv4p3qtly2fesrig77q4tlmi3wvakeet6fskc7do2fmawz3xctq]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-992264993]
oci_core_internet_gateway.igw: Refreshing state... [id=ocid1.internetgateway.oc1.uk-london-1.aaaaaaaamx6znggozz22j44wwzjj2rgkbj6qtvre2zof5zx7mdnteworc2qa]
oci_core_security_list.jacket_server_sl: Refreshing state... [id=ocid1.securitylist.oc1.uk-london-1.aaaaaaaavd3frfpehublgrylqsuanh2zrhzle26pkombuxvihastwenhiicq]
oci_core_route_table.rt: Refreshing state... [id=ocid1.routetable.oc1.uk-london-1.aaaaaaaaa3ttuox2egdwgtudtdpjv7ksl2uga6ke2tro7y7aevkmd2272rtq]
oci_core_subnet.subnet: Refreshing state... [id=ocid1.subnet.oc1.uk-london-1.aaaaaaaavmhe7xvtxdo2qtivr7clgwmc4ytgxtrhkxbkgbdpdckjpec5gmja]
oci_core_instance.jacket_server: Refreshing state... [id=ocid1.instance.oc1.uk-london-1.anwgiljtgi4f4iicr64edekiot47g7br5lqmpqzdvzmfda2s4zy3ucmq4tya]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_core_instance.jacket_server must be replaced
-/+ resource "oci_core_instance" "jacket_server" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljt4w3scckeyw4doil6mst6prz4dfnxbhmno3iuxqa3t5ozz5cmjsna" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/joe.poser@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2025-12-28T09:52:36.018Z"
        } -> (known after apply)
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ hostname_label                      = "jacketserver" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtgi4f4iicr64edekiot47g7br5lqmpqzdvzmfda2s4zy3ucmq4tya" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaaqqnwwvppjnkkabddcygclu3vbdytqyfou5cr65lqis6ztakru4a" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
          ~ "user_data"           = (sensitive value)
            # (1 unchanged element hidden)
        }
      ~ private_ip                          = "10.0.1.63" -> (known after apply)
      ~ public_ip                           = "130.162.173.232" -> (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaavmhe7xvtxdo2qtivr7clgwmc4ytgxtrhkxbkgbdpdckjpec5gmja" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2025-12-28 09:52:36.538 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/joe.poser@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2025-12-28T09:52:36.127Z"
            } -> (known after apply)
          ~ display_name              = "jacket-server" -> (known after apply)
          ~ freeform_tags             = {
              - "Project" = "jacket-server"
            } -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.1.63" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ instance_options (known after apply)
      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      ~ launch_options (known after apply)
      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      ~ launch_volume_attachments (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config (known after apply)
      - shape_config {
          - gpus                          = 0 -> null
          - local_disks                   = 0 -> null
          - local_disks_total_size_in_gbs = 0 -> null
          - max_vnic_attachments          = 1 -> null
          - memory_in_gbs                 = 1 -> null
          - networking_bandwidth_in_gbps  = 0.5 -> null
          - nvmes                         = 0 -> null
          - ocpus                         = 1 -> null
          - processor_description         = "2.25 GHz AMD EPYC™ 7742 (Rome)" -> null
          - vcpus                         = 2 -> null
            # (3 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_size_in_gbs         = "47" -> (known after apply)
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (3 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_core_security_list.jacket_server_sl will be updated in-place
  ~ resource "oci_core_security_list" "jacket_server_sl" {
        id             = "ocid1.securitylist.oc1.uk-london-1.aaaaaaaavd3frfpehublgrylqsuanh2zrhzle26pkombuxvihastwenhiicq"
        # (7 unchanged attributes hidden)

      - ingress_security_rules {
          - description = "SSH access" -> null
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null

          - tcp_options {
              - max = 22 -> null
              - min = 22 -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ app_url             = "http://130.162.173.232:5000" -> (known after apply)
  ~ instance_ocid       = "ocid1.instance.oc1.uk-london-1.anwgiljtgi4f4iicr64edekiot47g7br5lqmpqzdvzmfda2s4zy3ucmq4tya" -> (known after apply)
  ~ instance_private_ip = "10.0.1.63" -> (known after apply)
  ~ instance_public_ip  = "130.162.173.232" -> (known after apply)
  ~ ssh_command         = "ssh ubuntu@130.162.173.232" -> "ssh ubuntu@jacketserver (via Tailscale)"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @JPoser, Action: `pull_request`*